import React, { useState } from "react";
import "./academicwriting.css";
//לקחת כתבות גנריות ולשים אותם בסוג של מערך, ולעשות קומפוננתות שמציגות את הכתבות באתר
//ולהוסיף אופציות סינון לפי כל מיני פרמטרים שיש לי בכתבה
//אני חושב להשתמש בפרופס בתור מסננים

const academic_writing = [
  "דה-לגיטימציה הוא התהליך אשר בו מתוארת מדינה באור שלילי ביותר באופן מכוון, במאמץ להדירה מהקהילה הבין-לאומית, ולהציגה כבלתי ראויה להגנה שלה. מאמצי הדה-לגיטימציה נגד ישראל, רוצים למסגר את פעולותיה של מדינת ישראל בתור פגיעה בלתי-מוסרית בזכויות האדם, אשר דבר זה הוא מחוץ לנורמות המקובלות על החברה המערבית. לבידוד ישראל ולמערכה לדה-לגיטימציה יש שתי מטרות עיקריות: בטווח הקצר, ליצור לחץ בין-לאומי מוחץ על ישראל,  ולשנות בה מדיניויות שונות, לגייס את חופש התמרון הצבאי והדיפלומטי שלה ולבלום את היכולת שלה להגיב לנוכח פיגועי טרור ורקטות. בטווח הארוך, המטרה היא להחליש בסופו של דבר להביס את ישראל, על ידי שחיקת המעמד הבינלאומי שלה ופגיעה בזכות קיומה. בכך בידוד ישראל והמערכה לדה-לגיטימציה מבודדת אותה ומחלישה את מעמדה במשא ומתן עתידי, בנוסף להתקשרויות צבאיות.",
  "ב- 9 ביולי 2005, אוסף של 170 פעילים וארגונים פלסטינים החליטו להפסיק את הפסקת החרם של הליגה הערבית ופתחו בקריאה לחרם, מניעת השקעות וסנקציות (BDS) על ישראל. הBDS הוציא קריאה לחרם מצד אקדמאים ואמנים עד שישראל תעמוד בחוק הבינלאומי על ידי:1. סיום הכיבוש והקולוניזציה של כל ארצות ערב שנכבשו ביוני 1967 ופירוק החומה. 2.הכרה בזכויות היסוד של אזרחי ישראל הפלסטינים לשוויון מלא, וכן 3. שמירה, הגנה וקידום זכויותיהם של פליטים פלסטינים לחזור לבתיהם ורכושם, כקבוע בהחלטה 194 של האו'ם. הקריאה ל'חרם'- מתייחסת לבחירה פרטנית להימנע מרכישת סחורות ולעבודה עם אנשים או ארגונים העלולים להרוויח מהפרות ישראל של חוקים בינלאומיים הנוגעים לישראל. 'מניעת השקעות'- מתמקדת בכך שמוסדות וארגונים ימשכו את השקעותיהם מכל עסק שיכול להרוויח מהפרה של חוקים בינלאומיים הנוגעים לישראל. 'סנקציות'- מתייחסות ליישום חוקי מדינה שיאסרו על יחסי גומלין מסוימים, הרוב כלכליים, בין מדינה מסוימת לבין ישראל או עסקים ישראליים.",
  "רכישת קרקעות לפני קום המדינה הוא  נושא אשר דובר עליו לא מכבר, במיוחד שמדברים על המאה הקודמת. בעבודה זאת אנחנו סוקרים את התופעה דרך עדשה מצומצת יותר, שהיא תקופת הזמן של המרד הערבי הגדול, שהתרחש בין השנים 1936 - 1939. בעבודה זאת אנחנו הולכים לסקור את הצדדים אשר היו מעוברים בסוגיה: הצד הערבי, אשר הוא מכר את הקרקעות, והצד היהודי אשר רכש אותם על מנת להקים המדינה יהודית בארץ ישראל. לסוגיה נקודות מבט רבות, וכי האירועים אשר התרחשו בו זמנית היו גורם מכריע בהחלטות בנושא המדובר. כאמור, פרעות המרד הגדול היוו כנקודת השיא באותם שנים בעניין היחסים בין יהודים וערבים. סוגיית הקרקעות שבין יהודים וערבים התחילה עוד בתקופה העות'מאנית ולא מסתיימת עד ימינו אנו. בשנות ה-30 ואילך, מכירת קרקעות היוותה את מקור פרנסתם המרכזי של אנשי הכפר, אשר מכונים 'פלאחים'. פרנסתם הייתה מורכבת ממכירת היבול שהם מגדים ומכירת קרקעותיהם. הסיבה לכך היא כי תמיד היה ביקוש לקרקע מצד יהודים, אשר רצו להגדיל ולפתח את היישוב היהודי בארץ ישראל. ההנהגה הערבית לא ראתה בעין יפה מכירת קרקעות ליהודים ואף בהמשך פרסמה כרוזים ואיימה על חייהם של מי שימשיך לעשות זאת.",
  "קריקטורות, מהן? קיומם של קריקטורות הוכיח כמטריד את הפילוסופים והפסיכולוגים הכרוכים בניתוח ייצוג ציורי. הניגוד בין קריקטורה לבין ייצוג 'מציאותי' מקובל מהווה חלק מהבעיה. קריקטורה של דיוקן מייצגת בבירור פריסה מסוימת של צורה מרחבית, פריסה דמוית פנים עם אף כל כך ארוך, פה כל כך רחב וכו'. פריסה מרחבית זו בדרך כלל מתבדלת באופן מהותי ובצורות מחושבות מהצורה האמיתית של ראש הנבדק. איזו מין תמונה זו? הוא אינו מדויק במכוון, אך לרוב הנושא מזוהה למדי- אולי מזוהה יותר מאשר בדיוקן או בתצלום מדויק. הוא משקר לגבי צורתו של הנבדק, אך לעתים קרובות הוא מעיר באופן מענג על הצורה הזו. אם יש לנתח את התמונה הקונבנציונלית במונחים של התמונה המעבירה מידע לצופה על הנושא שלה, הרי שהקריקטורה אינה מהווה חלק מההסכמה ההיא, אלא מתבססת עליה, ומכופפת אותה למטרות מיוחדות.  דוגמא נוספת להגדרה של קריקטורה, היא שהציור של גבר על ידי קריקטוריסט אינו אפילו השלכה נאמנה של צורת תוויו וגופו. הוא אינו מייצג את הקימורים והקווי המתאר שלו. הקריקטורה עשויה להיות נאמנה לאותן תכונות של הגבר המבדילות אותו מכל הגברים האחרים ובכך עשויות לייצג אותו באמת במובן גבוה יותר של המונח. זה עשוי להתאים לו במובן של להיות ייחודי לו במיוחד יותר מאשר ציור השלכה או דיוקן צילומי. ",
  "הדיון ההיסטוריוגרפי בעניין 'מבשרי הציונות' מתנהל זה כ-90 שנה, מאז בואה לעולם של ההיסטוריוגרפיה הארץ-ישראלית בשנות העשרים של המאה הקודמת. את האידיאולוגים הציונים מעסיק עניין זה יותר ממאה שנה, משעה שעמדו על בעיית היותם כותבי ההיסטוריה של עצמם. הנושא שלי בעבודה זאת, היא תפיסת העולם הלאומית במשנתם של קלישר ואלקלעי- המשותף והשונה. בסמינריון זה אסקור את תולדותיהם של הרבנים, הרב יהודה בן שלמה חי אלקלעי והרב צבי הירש קלישר, אשר מזוהים בחלק מן 'מבשרי הציונות', אשר נחשבים לתחילת הציונות, ולהוגים הראשונים בכיוון זה. אני אסקור את חייהם של השניים, ובכל אחד אציג את חייו, הגורמים אשר השפיעו עליו ללכת לכיוון הרעיון הציוני, אשר בזמנו נקרא הרעיון הלאומי יהודי, ופעילותיהם בנושא. לאחר מכן אשווה בין תפיסותיהם הלאומיות של השניים, ולבסוף אסקור את השפעתם על הרעיון הציוני. אחד הדברים המייחדים את הרב אלקלעי והרב קלישר, הוא עצם בקשתם לחולל תמורה עמוקה הן בתודעה הלאומית והן במעשה היהודי הקיבוצי. השניים לא היססו למצות את קו מחשבתם עד סופו, והם מציגים תכנית מפורטת ומעשית אשר תואמת את משנתם המשיחית המושפעת מהלכי התקופה, ונסמכת על המקורות הכתובים המסורתיים .",
];

function AcademicWriting() {
  const [searchTerm, setSearchTerm] = useState("");
  const [AcademicWritingArray, setAcademicWritingArray] = useState([
    ...academic_writing,
  ]);

  const handleClick_length = () => {
    setAcademicWritingArray((prevArr) => {
      return prevArr.sort((a, b) => b.length - a.length);
    });
  };

  const handleClick_f_to_l = () => {
    setAcademicWritingArray((prevArr) => {
      return [...academic_writing];
    });
  };

  return (
    <div className="academicwriting">
      <div>
        <h1 align="center"> הנה כמה מכתבי האקדמאים </h1>
      </div>
      <div>
        <input
          type="text"
          placeholder="Search..."
          onChange={(event) => {
            setSearchTerm(event.target.value);
          }}
        />
        <br />
        Filter:
        <button value="by length" onClick={handleClick_length}>
          by length
        </button>
        <button value="first to last" onClick={handleClick_f_to_l}>
          first to last
        </button>
        <ul align="center">
          {AcademicWritingArray.filter((article) => {
            if (searchTerm === "") {
              return article;
            } else if (article.includes(searchTerm)) {
              return article;
            }
          }).map((article, index) => (
            <li key={index} value={article.length} index={index}>
              <br />
              {article}
            </li>
          ))}
        </ul>
      </div>
    </div>
  );
}

export default AcademicWriting;
